In [1]:
from sklearn.preprocessing import LabelEncoder

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('Simple.csv')
df.head()

    Name  Age  Gender       City Adult
0    Ram   56    male     mumbai   yes
1  Shyam   12    male      delhi    no
2  Lalit   30  female   parbhani   yes
3    Raj   20    male  Banghlore   yes
4   Ramu   15  female  Banghlore    no

In [4]:
le=LabelEncoder()
df['Gender_Encode']=le.fit_transform(df['Gender'])

In [5]:
df.head()

    Name  Age  Gender       City Adult  Gender_Encode
0    Ram   56    male     mumbai   yes              1
1  Shyam   12    male      delhi    no              1
2  Lalit   30  female   parbhani   yes              0
3    Raj   20    male  Banghlore   yes              1
4   Ramu   15  female  Banghlore    no              0

In [6]:
df['Adult_Encode']=le.fit_transform(df['Adult'])

In [7]:
df.head()

    Name  Age  Gender       City Adult  Gender_Encode  Adult_Encode
0    Ram   56    male     mumbai   yes              1             1
1  Shyam   12    male      delhi    no              1             0
2  Lalit   30  female   parbhani   yes              0             1
3    Raj   20    male  Banghlore   yes              1             1
4   Ramu   15  female  Banghlore    no              0             0

In [8]:
df.head()

    Name  Age  Gender       City Adult  Gender_Encode  Adult_Encode
0    Ram   56    male     mumbai   yes              1             1
1  Shyam   12    male      delhi    no              1             0
2  Lalit   30  female   parbhani   yes              0             1
3    Raj   20    male  Banghlore   yes              1             1
4   Ramu   15  female  Banghlore    no              0             0

In [9]:
df

    Name  Age  Gender       City Adult  Gender_Encode  Adult_Encode
0    Ram   56    male     mumbai   yes              1             1
1  Shyam   12    male      delhi    no              1             0
2  Lalit   30  female   parbhani   yes              0             1
3    Raj   20    male  Banghlore   yes              1             1
4   Ramu   15  female  Banghlore    no              0             0
5  Pintu   19    male      delhi   yes              1             1
6  Chiku   18  female     mumbai   yes              0             1

In [10]:
city_encoded = pd.get_dummies(df['City'], prefix='City', dtype=int)

df = pd.concat([df, city_encoded], axis=1)

In [13]:
df.head()

,Name,Age,Gender,City,Adult,Gender_Encode,Adult_Encode,City_Banghlore,City_delhi,City_mumbai,City_parbhani
0,Ram,56,male,mumbai,yes,1,1,0,0,1,0
1,Shyam,12,male,delhi,no,1,0,0,1,0,0
2,Lalit,30,female,parbhani,yes,0,1,0,0,0,1
3,Raj,20,male,Banghlore,yes,1,1,1,0,0,0
4,Ramu,15,female,Banghlore,no,0,0,1,0,0,0